//
//  DescriptionForAnimals.swift
//  Ecopedia_MVP
//
//  Created by Anatoliy Anatolyev on 16.12.2018.
//  Copyright © 2018 Valeriy. All rights reserved.
//

import Foundation

class DescripTionForAnimals {
    
    let descriptions: [Int: String] =
        [1:
            "Исторический ареал льва был значительно шире современного: ещё в раннем средневековье лев встречался на всей территории Африки, кроме пустынь и тропических лесов, также его можно было увидеть на Ближнем Востоке, Иране и даже в ряде мест южной Европы (к примеру, он обитал на части территории современного юга России, поднимаясь примерно до 45-й северной параллели). В Северной и Северо-Западной Индии лев был обычным хищником. Однако преследование со стороны человека и разрушение среды обитания привели к тому, что в Африке лев сохранился только к югу от Сахары, его ареал в настоящее время сильно сократился. В Азии небольшая популяция существует в Гирском лесу (в индийском штате Гуджарат).",
         2:
            "Эти млекопитающие хорошо приспособлены к жизни в суровой и безводной местности. У верблюдов имеются грудная, запястные, локтевые и наколенные мозоли. Этими частями верблюд соприкасается с землёй во время лежания и мозоли позволяют ему ложиться на раскалённую почву (до 70°С)[2]. Густой мех предназначен для защиты от дневного зноя и ночного холода. Пальцы верблюдов соединены между собой и образуют общую подошву [3]. Широкие двупалые ступни — для передвижения по сыпучим пескам или мелким камням. Верблюды не потеют и теряют малое количество жидкости с испражнениями. Влага, при дыхании выделяемая из ноздрей, собирается в особой складке и попадает в рот. Верблюд подолгу может обходиться без воды, теряя при этом до 40 % веса тела.",
         3:
            ""
    ]
    
    
    
}
